x1 = int(input("Введіть продажі 1 менеджера: "))
x2 = int(input("Введіть продажі 2 менеджера: "))
x3 = int(input("Введіть продажі 3 менеджера: "))

if x1 < 500:
    zp1 = 200 + x1 * 0.03
elif 500 <= x1 <= 1000:
    zp1 = 200 + x1 * 0.05
elif x1 > 1000:
    zp1 = 200 + x1 * 0.08

if x2 < 500:
    zp2 = 200 + x2 * 0.03
elif 500 <= x2 <= 1000:
    zp2 = 200 + x2 * 0.05
elif x2 > 1000:
    zp2 = 200 + x2 * 0.08
    
if x3 < 500:
    zp3 = 200 + x3 * 0.03
elif 500 <= x3 <= 1000:
    zp3 = 200 + x3 * 0.05
elif x3 > 1000:
    zp3 = 200 + x3 * 0.08
    
print(f"Зарплатня 1 - {zp1}\nЗарплатня 2 - {zp2}\nЗарплатня 3 - {zp3}")

if zp1 == zp2 == zp3:
    print("Всі продажі однакові, нихто не отримує премію(")
elif zp1 > zp2 and zp1 > zp3:
    zp1 += 200
    print(f"1 робітник отримує премію, його зарплата тепер - {zp1}")
elif zp2 > zp1 and zp2 > zp3:
    zp2 += 200
    print(f"2 робітник отримує премію, його зарплата тепер - {zp2}")
elif zp3 > zp2 and zp3 > zp1:
    zp3 += 200
    print(f"3 робітник отримує премію, його зарплата тепер - {zp3}")