x = {}

for i in range(2):
    y = input(f"Введіть {i} ключ: ")
    x[y] = input(f"Введіть значення для {i} ключа: ")
    
while True:
    print("Оберіть дію (1 - Відображененя словника)\n(2 - Пошук значення в словнику)\n(3 - Заміна значення в словнику. Значення має бути знайдено ключем)\n(4 - Відображення значення за ключем, введеним користувачем)\n(5 - Видалення значення за ключем, введеним користувачем)")
    t = int(input("Оберіть дію(0 для виходу): "))
    if t == 0:
        break
    elif t == 1:
        print(x)
    elif t == 2:
        h = input("Введіть ключ: ")
        print(f"Значення - {x[h]}")
    elif t == 3:
        h = input("Введіть ключ: ")
        x[h] = input("Введіть оновлене значення: ")
    elif t == 4:
        h = input("Введіть ключ: ")
        print(f"Значення - {x[h]}")
    elif t == 5:
        h = input("Введіть ключ: ")
        del x[h]