x1 = int(input("Введіть 1 координату для 1 клітинки: "))
y1 = int(input("Введіть 2 координату для 1 клітинки: "))
x2 = int(input("Введіть 1 координату для 2 клітинки: "))
y2 = int(input("Введіть 2 координату для 2 клітинки: "))

if x1 > 8 or x2 > 8 or y1 > 8 or y2 > 8:
    print("Не існуючі координати")
elif x1 < 1 or x2 < 1 or y1 < 1 or y2 < 1:
    print("Не існуючі координати")

if x1 % 2 == 0:
    if y1 % 2 == 0:
        n1 = 0
    else:
        n1 = 1
elif x1 % 2 != 0:
    if y1 % 2 == 0:
        n1 = 1
    else:
        n1 = 0

if x2 % 2 == 0:
    if y2 % 2 == 0:
        n2 = 0
    else:
        n2 = 1
elif x2 % 2 != 0:
    if y2 % 2 == 0:
        n2 = 1
    else:
        n2 = 0
        
if n1 == n2:
    print("Кольора однакові!")
else:
    print("Кольора різні!")